// Task 1. Напишите программу, которая на вход принимает два числа и выдаёт большее число.

// Console.Write("Imput a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Imput a second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if(num1 > num2)
// {
//     Console.WriteLine(num1);
// }
// else
// {
//     Console.WriteLine(num2);
// }

// Task 2. Напишите программу, которая принимает
// на вход три числа и выдаёт максимальное из этих чисел.

// Console.Write("Imput a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Imput a second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Imput a third number: ");
// int num3 = Convert.ToInt32(Console.ReadLine());

// int max = 0;

// if(num1 > max) max = num1;
// if(num2 > max) max = num2;
// if(num3 > max) max = num3;

// Console.Write("max = ");
// Console.WriteLine(max);