// Task 1. Напишите программу, которая на вход принимает два числа и выдаёт большее число.

// Console.Write("Imput a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Imput a second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if(num1 > num2)
// {
//     Console.WriteLine(num1);
// }
// else
// {
//     Console.WriteLine(num2);
// }

// Task 2. Напишите программу, которая принимает
// на вход три числа и выдаёт максимальное из этих чисел.

// Console.Write("Imput a first number: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Imput a second number: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Imput a third number: ");
// int num3 = Convert.ToInt32(Console.ReadLine());

// int max = 0;

// if(num1 > max) max = num1;
// if(num2 > max) max = num2;
// if(num3 > max) max = num3;

// Console.Write("max = ");
// Console.WriteLine(max);

// Task 3. Напишите программу, которая на вход принимает число и выдаёт, 
//является ли число чётным (делится ли оно на два без остатка).

// Console.Write("Imput a number: ");
// int num = Convert.ToInt32(Console.ReadLine());

// if(num % 2 == 0)
// {
//     Console.WriteLine("YES");
// }
// else
// {
//     Console.WriteLine("NO");
// }

// Task 4. Напишите программу, которая на вход принимает число (N), 
//а на выходе показывает все чётные числа от 1 до N.

// Console.Write("Imput a number: ");
// int number = Convert.ToInt32(Console.ReadLine());

// for(int i = 1; i <= number; i++)
// {
//     if(i % 2 == 0)
//     Console.Write(i + " ");
// }